hw-rails-intro/rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

  def index
    @movies = Movie.all

    @all_ratings = []#stores all unique ratings
    #push each unique rating into 'all_ratings'
    Movie.select(:rating).uniq.each {|r| @all_ratings.push(r.rating)}

    if params[:ratings]#if refresh is clicked
        #find rating in database where the rating==checked box
        session[:ratings] = params[:ratings].keys#remember the checked box data
    end
    @movies = Movie.where(:rating=>session[:ratings]) #find all movies that have the same rating



    if params[:sort] == nil#when params[:sort] is not available
      @sort = session[:sort]#save the session into '@sort'

    else #if sort is clicked "Movie Title" or "release data"
      @sort = params[:sort]
      session[:sort] = params[:sort]#remember the sort and save into the session
    end

    @movies = @movies.order(@sort)#sort the movies based on '@sort'
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY release_date
SELECT "movies".* FROM "movies"  ORDER BY "movies"."rating" ASC